{
  "title-insurance": {
    "slug": "title-insurance",
    "title": "Title Insurance",
    "subtitle": "Comprehensive Title Search and Insurance Services",
    "icon": "fas fa-shield-alt",
    "color": "primary",
    "sections": [
      {
        "title": "Title Search Services",
        "content": "We have a combination of experienced Abstractors and Title Analysts with an in-depth understanding of U.S. title Industry, spanning across various States and counties. Each Abstractor possesses at least 8 years of experience in Title search and Typists are well versed with typing out the reports in client software's such as Gators, Ramp Quest, Web-based and MS Word Document."
      },
      {
        "title": "FROM CURRENT OWNER SEARCH OR TWO OWNER SEARCH TO FULL SEARCH",
        "content": "We have an experienced network of abstractors and attorneys delivering across all counties of the USA, exemplary accurate searches, within the TAT(Turn Around Time). Some of our title search services include",
        "bullets": [
          "Title/ Property Search",
          "Current Owner Search",
          "Two Owner Search",
          "Legal & Vesting Search",
          "Full Search",
          "Doc Retrieval Search",
          "Update Search",
          "Mortgage Search"
        ]
      },
      {
        "title": "Document Preparation",
        "bullets": [
          "Legal & Vesting Reports",
          "Abstract Reports",
          "Commitment Reports",
          "Property Reports",
          "Short Form Policies",
          "Long Form Policies",
          "HUD Preparation"
        ]
      },
      {
        "title": "Process",
        "type": "steps",
        "steps": [
          {
            "step": 1,
            "title": "Order Entry",
            "details": [
              "Verify property information and place order for search docs (In-House or Outside Abstractor)"
            ]
          },
          {
            "step": 2,
            "title": "Examination",
            "details": [
              "Examination of documents found during search that affect the title of the property",
              "Review of Legal Ownership, Property Taxes, Judgements/ Liens"
            ]
          },
          {
            "step": 3,
            "title": "Curative",
            "details": [
              "Review Chain of Title",
              "Verifying Vesting",
              "Curing Open Mortgages",
              "Clear Title and issue CTC to the Lender"
            ]
          },
          {
            "step": 4,
            "title": "Scheduling",
            "details": [
              "Calling Borrowers to confirm on Closing Date, Time, and Location",
              "Fixing Notary to the Closing",
              "Confirm Closing Status"
            ]
          },
          {
            "step": 5,
            "title": "Closing Disclosure",
            "details": [
              "Key all relevant Fees",
              "Calculate prior mortgage Payoff",
              "Confirming Hazard Insurance Status",
              "Confirming Property Taxes",
              "Prepare CD to deliver to the Borrowers",
              "Ensure accuracy of the delivered CD"
            ]
          },
          {
            "step": 6,
            "title": "Doc Prep",
            "details": [
              "Assigning Closing Package to Notary/ Attorney to perform Closing"
            ]
          },
          {
            "step": 7,
            "title": "Post Closing",
            "details": [
              "Review the signed package",
              "Prepare Funding Documents",
              "Send to lender requesting for Disbursal of Funds"
            ]
          },
          {
            "step": 8,
            "title": "Funding",
            "details": [
              "Assigning Closing Package to Notary/ Attorney to perform Closing"
            ]
          },
          {
            "step": 9,
            "title": "Recording",
            "details": [
              "Upload all Documents and assign to all non Online Vendors"
            ]
          },
          {
            "step": 10,
            "title": "Policy Production",
            "details": [
              "Keying all the pertinent details in the system and generating the Policies"
            ]
          }
        ]
      },
      {
        "title": "Additional Services",
        "bullets": [
          "DATA ENTRY AND TITLE DOCUMENT INDEXING",
          "DOCUMENT CONVERSION SERVICES",
          "LOAN MODIFICATION"
        ]
      },
      {
        "title": "DATA ENTRY AND TITLE DOCUMENT INDEXING",
        "content": "At Ardur we undertake text indexing services where data is readily available and quickly responds to users. Our data management experts handle text indexing using unique words and phrases which can search in the local database or other digital databases."
      }
    ]
  },
  "title-plant-development": {
    "slug": "title-plant-development",
    "title": "Title Plant Development",
    "subtitle": "Professional Title Plant Indexing Services",
    "icon": "fas fa-database",
    "color": "secondary",
    "sections": [
      {
        "title": "Overview",
        "content": "We provide Title Plant Indexing services to the Real Estate industry across the U.S.A. We capture information from property related documents such as Deed, Deed of Trust, Lien documents, Marriage Certificates, Right of way, Easement and other documents."
      },
      {
        "title": "OUR DATA CAPTURE COMPRISES OF",
        "bullets": [
          "Parties related information (Grantor, Grantee, Document Type, Amount and Dates).",
          "Legal details (Subdivision, Block, lot, Acreage, volume, page and prior references)."
        ]
      },
      {
        "title": "Quality & Turnaround",
        "content": "We have expertise to key the back plant documents as well as Go Forward documents with excellent quality and turnaround time. We process double key and triple compare of each and every document to maintain 99.995% accuracy."
      },
      {
        "title": "Projection",
        "content": "We provide Projection for Back Plant Indexing and for Go Forward."
      }
    ]
  },
  "tax-services": {
    "slug": "tax-services",
    "title": "Tax Services",
    "subtitle": "Comprehensive Property Tax and Municipal Lien Reports",
    "icon": "fas fa-file-invoice-dollar",
    "color": "accent",
    "sections": [
      {
        "title": "Overview",
        "content": "We deliver comprehensive property tax, Municipal lien and code violation reports to the title and banking industry. Our services include residential and commercial pre closing certificates, code and assessment violation reports, escrow and non escrow reporting and tax line setup."
      },
      {
        "title": "Reliable, Accurate and Timely Tax Reporting",
        "content": "Our Tax Amount Report provides details such as due dates, tax amounts, and required methods of payment. Lenders and servicers can rely on Ardur for reliable procurement of tax information, accurate payment specifications of tax authorities, and timely payments."
      }
    ]
  },
  "appraisal-management-services": {
    "slug": "appraisal-management-services",
    "title": "Appraisal Management Services",
    "subtitle": "Professional Appraisal Review and Management",
    "icon": "fas fa-home",
    "color": "purple",
    "sections": [
      {
        "title": "Appraisal Review",
        "content": "Enriched with over 10 years of experience in handling appraisal services, working with all types of appraisers, loan types, and lenders. Our Appraisal Quality Control teams understand the different type of forms, lender requirements, checklists to perform quality control appraisal review, for our customers."
      },
      {
        "title": "Review Tasks",
        "bullets": [
          "Review Appraisal Reports for Accuracy",
          "Re-Review Appraisal Reports upon receipt of revised Appraisal Reports",
          "Handle Post Completion Revision Requests from the Clients"
        ]
      },
      {
        "title": "Forms We Deal With",
        "bullets": [
          "1004 - Uniform Residential Appraisal Report",
          "1004C - Manufactured Home Appraisal Report",
          "1004D - Appraisal Update and/or Completion Report",
          "1073 - Individual Condominium Unit Appraisal Report",
          "1025 - Small Residential Income Property Appraisal Report",
          "1075 - Exterior-Only Individual Condominium Unit Appraisal Report",
          "2000 - One-Unit Residential Appraisal Field Review Report",
          "2000A - Two- to four-Unit Residential Appraisal Field Review Report",
          "2075 - Desktop Underwriter Property Inspection Report",
          "2055 - Exterior-Only Inspection Residential Appraisal Report",
          "2090 - Individual Cooperative Interest Appraisal Report",
          "2095 - Exterior-Only Inspection Individual Cooperative Interest Appraisal Report",
          "1007 - Single Family Comparable Rent Schedule",
          "216 - Operating Income Statement"
        ]
      },
      {
        "title": "Order Management",
        "bullets": [
          "Order Entry - Currently doing order entry on the portal of our clients",
          "Payment Processing",
          "Order Assignment - Manually Assigning of orders to Appraisers/Brokers"
        ]
      }
    ]
  },
  "broker-price-opinion": {
    "slug": "broker-price-opinion",
    "title": "Broker Price Opinion (BPO)",
    "subtitle": "Professional Property Valuation Services",
    "icon": "fas fa-chart-line",
    "color": "warning",
    "sections": [
      {
        "title": "Overview",
        "content": "In order to provide a broker price opinion, we look at comparable homes that have sold recently, typically within the past three months in the same neighbourhood, and make pricing adjustments based on a variety of factors such as the size, condition and location of the home."
      }
    ]
  },
  "appraisal-vendor-management": {
    "slug": "appraisal-vendor-management",
    "title": "Appraisal Vendor Management & Customer Service",
    "subtitle": "Complete Vendor and Order Management Solutions",
    "icon": "fas fa-users-cog",
    "color": "primary",
    "sections": [
      {
        "title": "1. Appointment Tracking and Follow up",
        "content": "We act as a communication channel between the appraiser and the client to ensure the appointment date is set by the appraiser as soon as possible and if they are facing any issue we take the right action to handle the situation and keep the client updated."
      },
      {
        "title": "2. Qualifying New Appraisers",
        "content": "Ardur generates as possible appraisers to your appraiser database after verifying their various documents such as W9, License, E&O, etc., or any other document required. Placement - We own the responsibility to find quotes for a particular order from the appraisers and then updating all the quotes received and selecting the appraiser whose quote suits the client the most."
      },
      {
        "title": "3. Updation of Vendor Details",
        "content": "We update the details of the vendor with the latest information or any new changes made and ensure that their insurance and license are up to date."
      },
      {
        "title": "4. Reports Updation",
        "content": "We monitor and ensure that the appraiser submits the report one or two days before the due date. If the request for extension of the due date, we take the appropriate action as well as if they face any other issue we work on it to solve it as soon as possible."
      },
      {
        "title": "5. Delivery of Reports",
        "content": "We upload the report manually or any other method available in the Appraisal Software."
      },
      {
        "title": "6. Quote Requests",
        "content": "Our Team provides a detailed quote request which will detail the client, product(s), property address, loan type, and transaction type. Ardur will determine which appraisers are eligible for the potential assignment and email those appraisers for quotes. The Ardur Team shall review the options to quote their client."
      },
      {
        "title": "7. Appraisal - Vendor and Order Management",
        "content": "We keep the profile of a Vendor updated matching the details in the ASC site and keep the client updated about the same. We act as a communication bridge between the clients and the appraisers."
      },
      {
        "title": "8. Status Management",
        "bullets": [
          "Follow up on Assigned orders",
          "Check or Confirm Inspection schedule and Submission of report",
          "Follow-up with Appraisers to obtain revised Appraisal Reports",
          "Procurement of PA and FHA case numbers",
          "Review of Docs, i.e., PA, Bids, and Prior/Original Reports"
        ]
      }
    ]
  }
}
