{
  "title-insurance": {
    "slug": "title-insurance",
    "title": "Title Search and Settlement",
    "subtitle": "Professional Title Search & Settlement Services for Real Estate Transactions",
    "icon": "fas fa-shield-alt",
    "color": "primary",
    "sections": [
      {
        "title": "Title Search Services",
        "content": "Our certified title abstractors and title analysts deliver nationwide title search services across all 50 U.S. states and 3,000+ counties. With 8+ years of average experience per abstractor, we provide comprehensive property research, title abstracting, and title examination services using industry-leading platforms including Gators, Ramp Quest, Data Trace, and proprietary title search software for superior accuracy and speed."
      },
      {
        "title": "FROM CURRENT OWNER SEARCH OR TWO OWNER SEARCH TO FULL SEARCH",
        "content": "We deliver comprehensive title search services including Current Owner Search, Two-Owner Search, Full Title Search, and Update Search services. Our nationwide network of experienced title abstractors and title examiners guarantees 24-48 hour turnaround times with 99.8% accuracy for mortgage lenders, title companies, real estate attorneys, and settlement agents.",
        "bullets": [
          "Title/ Property Search",
          "Current Owner Search",
          "Two Owner Search",
          "Legal & Vesting Search",
          "Full Search",
          "Doc Retrieval Search",
          "Update Search",
          "Mortgage Search"
        ]
      },
      {
        "title": "Document Preparation",
        "bullets": [
          "Legal & Vesting Reports",
          "Abstract Reports",
          "Commitment Reports",
          "Property Reports",
          "Short Form Policies",
          "Long Form Policies",
          "HUD Preparation"
        ]
      },
      {
        "title": "Process",
        "type": "steps",
        "steps": [
          {
            "step": 1,
            "title": "Order Entry",
            "details": [
              "Verify property information and place order for search docs (In-House or Outside Abstractor)"
            ]
          },
          {
            "step": 2,
            "title": "Examination",
            "details": [
              "Examination of documents found during search that affect the title of the property",
              "Review of Legal Ownership, Property Taxes, Judgements/ Liens"
            ]
          },
          {
            "step": 3,
            "title": "Curative",
            "details": [
              "Review Chain of Title",
              "Verifying Vesting",
              "Curing Open Mortgages",
              "Clear Title and issue CTC to the Lender"
            ]
          },
          {
            "step": 4,
            "title": "Scheduling",
            "details": [
              "Calling Borrowers to confirm on Closing Date, Time, and Location",
              "Fixing Notary to the Closing",
              "Confirm Closing Status"
            ]
          },
          {
            "step": 5,
            "title": "Closing Disclosure",
            "details": [
              "Key all relevant Fees",
              "Calculate prior mortgage Payoff",
              "Confirming Hazard Insurance Status",
              "Confirming Property Taxes",
              "Prepare CD to deliver to the Borrowers",
              "Ensure accuracy of the delivered CD"
            ]
          },
          {
            "step": 6,
            "title": "Doc Prep",
            "details": [
              "Assigning Closing Package to Notary/ Attorney to perform Closing"
            ]
          },
          {
            "step": 7,
            "title": "Post Closing",
            "details": [
              "Review the signed package",
              "Prepare Funding Documents",
              "Send to lender requesting for Disbursal of Funds"
            ]
          },
          {
            "step": 8,
            "title": "Funding",
            "details": [
              "Assigning Closing Package to Notary/ Attorney to perform Closing"
            ]
          },
          {
            "step": 9,
            "title": "Recording",
            "details": [
              "Upload all Documents and assign to all non Online Vendors"
            ]
          },
          {
            "step": 10,
            "title": "Policy Production",
            "details": [
              "Keying all the pertinent details in the system and generating the Policies"
            ]
          }
        ]
      },
      {
        "title": "Additional Services",
        "bullets": [
          "DATA ENTRY AND TITLE DOCUMENT INDEXING",
          "DOCUMENT CONVERSION SERVICES",
          "LOAN MODIFICATION"
        ]
      },
      {
        "title": "DATA ENTRY AND TITLE DOCUMENT INDEXING",
        "content": "Ardur delivers specialized title data entry and title document indexing services designed to streamline your title production workflow. Our certified data management specialists employ advanced OCR technology, automated indexing systems, and quality control protocols to ensure your title plant data, property records, and document repositories are 100% accurate, fully searchable, and instantly accessible through your title production software or cloud-based title management systems."
      }
    ]
  },
  "title-plant-development": {
    "slug": "title-plant-development",
    "title": "Title Plant Indexing",
    "subtitle": "Expert Title Plant Indexing Services for Title Companies",
    "icon": "fas fa-database",
    "color": "secondary",
    "sections": [
      {
        "title": "Overview",
        "content": "We deliver comprehensive title plant indexing and title plant development services to the real estate and title insurance industry nationwide. Our experienced title plant specialists accurately capture, index, and maintain critical property data from recorded documents including Deeds, Mortgages, Liens, Maps, Plats, and subdivision records, building a robust, searchable, and ALTA-compliant title plant database for seamless title production and property research."
      },
      {
        "title": "OUR DATA CAPTURE COMPRISES OF",
        "bullets": [
          "Parties related information (Grantor, Grantee, Document Type, Amount and Dates).",
          "Legal details (Subdivision, Block, lot, Acreage, volume, page and prior references)."
        ]
      },
      {
        "title": "Quality & Turnaround",
        "content": "We specialize in both back plant indexing and go-forward daily posting with guaranteed 99.995% accuracy. Our title plant keying process includes double-key entry and triple compare verification on every document, ensuring exceptional data quality and turnaround time. We process thousands of documents monthly for title companies, abstracting firms, and title insurance underwriters."
      },
      {
        "title": "Projection",
        "content": "We provide detailed capacity projections and timeline estimates for back plant indexing projects and go-forward daily posting operations, helping you plan your title plant development or conversion initiatives."
      }
    ]
  },
  "tax-services": {
    "slug": "tax-services",
    "title": "Tax Services",
    "subtitle": "Comprehensive Property Tax Research, Municipal Lien Search & Tax Certificate Services",
    "icon": "fas fa-file-invoice-dollar",
    "color": "accent",
    "sections": [
      {
        "title": "Overview",
        "content": "We provide comprehensive property tax research, municipal lien searches, code violation reports, and property tax certificate services to the title insurance, mortgage lending, and real estate industries. Our tax services include pre-closing tax certificates, property tax assessment analysis, delinquent tax searches, tax lien verification, and tax line setup with local municipalities, ensuring complete visibility and accurate reporting of all property tax obligations and municipal liens."
      },
      {
        "title": "Reliable, Accurate and Timely Tax Reporting",
        "content": "Our property tax reporting services provide complete details including tax due dates, current and past-due tax amounts, penalty calculations, payment instructions, and taxing authority contact information. Mortgage lenders, loan servicers, and title companies rely on Ardur for accurate tax data procurement, verified payment specifications from tax authorities, and timely property tax status updates for residential and commercial properties."
      }
    ]
  },
  "appraisal-management-services": {
    "slug": "appraisal-management-services",
    "title": "Appraisal Management Services",
    "subtitle": "Professional Appraisal Review & Appraisal Management Company (AMC) Support Services",
    "icon": "fas fa-home",
    "color": "purple",
    "sections": [
      {
        "title": "Appraisal Review",
        "content": "With 10+ years of specialized experience, our certified Appraisal Quality Control (AQC) team delivers expert appraisal review, appraisal desk review, and appraisal field review services for mortgage lenders, AMCs (Appraisal Management Companies), and financial institutions. We thoroughly understand diverse lender overlays, investor guidelines (Fannie Mae, Freddie Mac, FHA, VA), and all FNMA/FHLMC appraisal forms, ensuring every residential appraisal report meets USPAP standards, UAD compliance, and strict quality control requirements."
      },
      {
        "title": "Review Tasks",
        "bullets": [
          "Review Appraisal Reports for Accuracy",
          "Re-Review Appraisal Reports upon receipt of revised Appraisal Reports",
          "Handle Post Completion Revision Requests from the Clients"
        ]
      },
      {
        "title": "Forms We Deal With",
        "bullets": [
          "1004 - Uniform Residential Appraisal Report",
          "1004C - Manufactured Home Appraisal Report",
          "1004D - Appraisal Update and/or Completion Report",
          "1073 - Individual Condominium Unit Appraisal Report",
          "1025 - Small Residential Income Property Appraisal Report",
          "1075 - Exterior-Only Individual Condominium Unit Appraisal Report",
          "2000 - One-Unit Residential Appraisal Field Review Report",
          "2000A - Two- to four-Unit Residential Appraisal Field Review Report",
          "2075 - Desktop Underwriter Property Inspection Report",
          "2055 - Exterior-Only Inspection Residential Appraisal Report",
          "2090 - Individual Cooperative Interest Appraisal Report",
          "2095 - Exterior-Only Inspection Individual Cooperative Interest Appraisal Report",
          "1007 - Single Family Comparable Rent Schedule",
          "216 - Operating Income Statement"
        ]
      },
      {
        "title": "Order Management",
        "bullets": [
          "Order Entry - Currently doing order entry on the portal of our clients",
          "Payment Processing",
          "Order Assignment - Manually Assigning of orders to Appraisers/Brokers"
        ]
      }
    ]
  },
  "broker-price-opinion": {
    "slug": "broker-price-opinion",
    "title": "Broker Price Opinion (BPO)",
    "subtitle": "Professional Broker Price Opinion (BPO) & Automated Valuation Model (AVM) Services",
    "icon": "fas fa-chart-line",
    "color": "warning",
    "sections": [
      {
        "title": "Overview",
        "content": "Our Broker Price Opinion (BPO) services deliver reliable desktop and drive-by property valuations based on recent comparable sales analysis (comps), current market trends, and local market conditions. We analyze critical factors including property location, physical condition, neighborhood characteristics, and market absorption rates to provide accurate property valuations for loan servicing, default management, REO disposition, portfolio analysis, and loss mitigation for mortgage servicers and asset management companies."
      }
    ]
  },
  "appraisal-vendor-management": {
    "slug": "appraisal-vendor-management",
    "title": "Appraisal Vendor Management & Customer Service",
    "subtitle": "Complete Appraisal Vendor Management & AMC Administrative Support Solutions",
    "icon": "fas fa-users-cog",
    "color": "primary",
    "sections": [
      {
        "title": "1. Appointment Tracking and Follow up",
        "content": "We serve as the primary communication liaison between appraisers and your appraisal management team to expedite inspection appointments and ensure timely scheduling. Our appraiser coordination team proactively follows up on inspection confirmations, handles scheduling conflicts, resolves access issues, and keeps all stakeholders updated on appointment status to maintain efficient appraisal order flow and meet critical loan closing deadlines."
      },
      {
        "title": "2. Qualifying New Appraisers",
        "content": "Ardur rigorously qualifies and onboards new residential and commercial appraisers to expand your appraiser panel nationwide. We verify all required credentials including state appraiser licenses, E&O insurance certificates, W9 forms, and any additional documentation per your compliance requirements. We also handle fee quote solicitation, appraiser coverage area mapping, and optimal appraiser selection based on experience, turnaround time, and competitive pricing."
      },
      {
        "title": "3. Updation of Vendor Details",
        "content": "We continuously maintain and update your appraiser vendor database with the latest contact information, license renewals, E&O insurance updates, and coverage area changes, ensuring your appraiser panel remains active, compliant, and readily available for order assignments through your appraisal management platform."
      },
      {
        "title": "4. Reports Updation",
        "content": "We proactively monitor appraisal report due dates and follow up with appraisers to ensure timely submission 1-2 days before the contractual deadline. We efficiently process extension requests, communicate delays to lenders, troubleshoot appraiser challenges, and coordinate revisions to keep your appraisal pipeline on track and avoid loan closing delays."
      },
      {
        "title": "5. Delivery of Reports",
        "content": "We handle the upload and delivery of completed appraisal reports directly into your appraisal management software platform (Mercury Network, Clear Capital, ServiceLink, SettlementOne, or other AMC portals), ensuring secure, timely delivery to underwriters and loan processors."
      },
      {
        "title": "6. Quote Requests",
        "content": "Our appraiser coordination team generates and distributes detailed quote requests containing client information, appraisal product type, property details, loan characteristics, and transaction type. We identify eligible appraisers based on coverage area and credentials, solicit competitive fee quotes, and present the best options based on cost, turnaround time, and quality to optimize your appraisal assignment process."
      },
      {
        "title": "7. Appraisal - Vendor and Order Management",
        "content": "We maintain complete appraiser vendor profiles with up-to-date information cross-referenced with the Appraiser Standards Board (ASB) and state licensing databases. We function as a seamless communication bridge between your clients, lenders, underwriters, and the appraisal vendor network, facilitating efficient appraisal order management and resolution of quality or timeline issues."
      },
      {
        "title": "8. Status Management",
        "bullets": [
          "Follow up on Assigned orders",
          "Check or Confirm Inspection schedule and Submission of report",
          "Follow-up with Appraisers to obtain revised Appraisal Reports",
          "Procurement of PA and FHA case numbers",
          "Review of Docs, i.e., PA, Bids, and Prior/Original Reports"
        ]
      }
    ]
  },
  "mortgage-pre-processing": {
    "slug": "mortgage-pre-processing",
    "title": "Mortgage Pre-Processing Support Services",
    "subtitle": "Accelerate loan approvals with expert mortgage pre-processing outsourcing & loan origination support services",
    "icon": "fas fa-file-contract",
    "color": "secondary",
    "sections": [
      {
        "title": "Rate Lock Management",
        "content": "Our dedicated mortgage processing team manages the entire rate lock process and interest rate commitment workflow, ensuring rapid response times and borrower satisfaction. We coordinate directly with borrowers and lenders to secure loan commitments within the rate lock period, minimizing interest rate risk, avoiding extension fees, and enhancing customer experience through efficient mortgage pre-processing and loan origination support."
      },
      {
        "title": "CAIVARS Verification",
        "content": "We perform comprehensive CAIVARS (Credit Alert Verification Reporting System) screening to verify borrowers have no history of delinquent federal non-tax debt including VA debts, HUD debts, SBA loans, or student loan defaults. We verify borrower profiles against the CAIVARS database in full compliance with the Debt Collection Improvement Act (DCIA) to protect lenders from high-risk mortgage applications."
      },
      {
        "title": "1003 Review",
        "content": "We meticulously review and validate the Uniform Residential Loan Application (URLA Form 1003) to verify all borrower-supplied information including personal details, employment history, income documentation, asset verification, property details, loan amount, signatures, and disclosures are complete and accurate before submission to underwriting."
      },
      {
        "title": "MERS Check",
        "content": "Our certified mortgage processing specialists compile comprehensive borrower reports and register loans with MERS (Mortgage Electronic Registration System), enabling efficient tracking of loan ownership transfers, servicing rights, and lien positions throughout the entire mortgage lifecycle."
      },
      {
        "title": "Loan Estimation Review",
        "content": "We prepare and deliver accurate Loan Estimates (LE) to borrowers within 3 business days of application, including all required disclosures such as loan terms, interest rate, monthly payment, closing costs, APR, and final payment schedule in full compliance with TRID (TILA-RESPA Integrated Disclosure) regulations."
      },
      {
        "title": "Generation of Disclosures",
        "content": "We generate and deliver all mandatory federal mortgage disclosures including Loan Estimate (LE), Closing Disclosure (CD), TRID disclosures, RESPA disclosures, and state-specific loan disclosures to borrowers in compliance with Regulation Z, TILA, and consumer protection laws, completing this critical step in the mortgage pre-processing workflow."
      }
    ]
  },
  "mortgage-ancillary": {
    "slug": "mortgage-ancillary",
    "title": "Mortgage Ancillary Services",
    "subtitle": "Streamlined mortgage document management, third-party verification & ancillary support for lenders",
    "icon": "fas fa-folder-open",
    "color": "accent",
    "sections": [
      {
        "title": "Indexing and Stacking",
        "content": "We streamline your loan file assembly by collecting, organizing, and indexing all essential loan documentation including bank statements, pay stubs, W-2s, tax returns, pension statements, divorce decrees, child support orders, and HOA documents. Our team coordinates homeowner's insurance (HOI) policies and FEMA flood certificate orders, then expertly stacks and indexes all files into your loan origination system (LOS) for seamless mortgage processing workflow."
      },
      {
        "title": "Third Part Document Verification",
        "content": "We conduct comprehensive third-party document verification and quality control review of appraisal reports, title commitments, homeowner's insurance (HOI) declarations, 4506-T tax transcripts, employment verifications, and asset verifications. We validate appraisal fees, verify property title clearance, and provide detailed compliance reports highlighting any discrepancies, contradictory information, or data inconsistencies to ensure regulatory compliance with Fannie Mae, Freddie Mac, FHA, and VA guidelines."
      },
      {
        "title": "Data Capture in LOS",
        "content": "We review the 1003 (URLA) application and all supporting income documentation including W-2s, pay stubs, tax returns, Good Faith Estimate (GFE), Truth-in-Lending (TIL) disclosure, Form 1008 (Uniform Underwriting and Transmittal Summary), and borrower authorization forms, then accurately key all data into your loan origination system (Encompass, Calyx Point, BytePro, etc.) ensuring 100% data accuracy for seamless loan processing."
      }
    ]
  },
  "mortgage-appraisal": {
    "slug": "mortgage-appraisal",
    "title": "Mortgage Appraisal Services",
    "subtitle": "Comprehensive property appraisal review & valuation management services for mortgage lenders",
    "icon": "fas fa-home-lg-alt",
    "color": "primary",
    "sections": [
      {
        "title": "Broker Price Opinion",
        "content": "We deliver accurate Broker Price Opinions (BPO) and desktop valuations for properties valued under $250K, providing a cost-effective alternative to full appraisals for portfolio valuation, default management, REO disposition, loss mitigation, and streamline refinance programs."
      },
      {
        "title": "Appraiser Panel Review",
        "content": "Our certified appraisal review specialists ensure every appraisal report adheres to current Uniform Appraisal Dataset (UAD) standards, Uniform Standards of Professional Appraisal Practice (USPAP), and regional lending guidelines. We verify methodology consistency, comparable sales selection, adjustments, and final value conclusion across all property types and loan programs."
      },
      {
        "title": "Compliance",
        "content": "We comprehensively examine appraisal reports for anomalies, data inconsistencies, and compliance violations. We verify valuation methodology, validate comparable sales, review market analysis, and ensure full compliance with Fannie Mae, Freddie Mac, FHA, VA, and state-specific appraisal regulations to mitigate lender risk and ensure investor acceptance."
      },
      {
        "title": "Comparative Market Analysis",
        "content": "We perform comprehensive Comparative Market Analysis (CMA) gathering detailed property data including list price, days on market, sale price, price per square foot, and market trends to expedite financing approval and ensure fair market value for purchase transactions and refinances."
      },
      {
        "title": "Title Assessment",
        "content": "We conduct preliminary title assessments reviewing property tax records, judgment liens, mechanic's liens, and transfer history to identify potential title issues early in the loan process, providing lenders and borrowers confidence in clear title status before closing."
      }
    ]
  },
  "mortgage-underwriting": {
    "slug": "mortgage-underwriting",
    "title": "Mortgage Underwriting Services",
    "subtitle": "Expert mortgage underwriting support, risk assessment & loan quality control services",
    "icon": "fas fa-clipboard-check",
    "color": "purple",
    "sections": [
      {
        "title": "Pre-Underwriting (Loan Submission)",
        "content": "Our pre-underwriting and loan submission services include comprehensive document validation, eligibility verification, and condition identification. We proactively flag potential issues such as late payment explanations, employment gaps, credit score concerns, or documentation deficiencies, accelerating the condition clearing process and ensuring smooth submission to final underwriting for faster loan approvals."
      },
      {
        "title": "Credit Report",
        "content": "We order tri-merge credit reports and perform comprehensive credit analysis of prospective borrowers including FICO score review, credit history evaluation, tradeline verification, FHA credit authorization, Social Security Number (SSN) validation, MERS loan search, payment default screening, and IRS tax return verification to assess creditworthiness and loan repayment capacity."
      },
      {
        "title": "Income and Asset Review",
        "content": "We conduct comprehensive verification of income, employment, and asset documentation provided by borrowers. Our verification process includes Verification of Employment (VOE), Verification of Deposit (VOD), Verification of Mortgage (VOM), pay stub analysis, W-2 validation, tax return review, bank statement verification, property sale history checks, and appraiser license verification to ensure full documentation and borrower qualifications per Fannie Mae, Freddie Mac, and FHA guidelines."
      },
      {
        "title": "Borrower File Review",
        "content": "We meticulously review complete borrower loan files including Form 1003 (URLA), credit reports, FICO scores, 1040 tax returns, and financial statements to verify borrower capacity to make monthly mortgage payments. We evaluate the complete credit profile against Fannie Mae DU (Desktop Underwriter) and Freddie Mac LPA (Loan Product Advisor) guidelines using our proven checklist-based quality control system, ensuring all critical underwriting criteria are met before final loan approval."
      },
      {
        "title": "Data Validation",
        "content": "We utilize automated underwriting systems including Desktop Underwriter (DU) from Fannie Mae and Loan Product Advisor (LPA) from Freddie Mac to validate critical borrower attributes including credit scores, income calculations, employment history, and debt-to-income (DTI) ratios. Our mortgage underwriting support team digitizes all AUS findings and validation results to establish the accuracy and processing speed required for expedited loan underwriting decisions."
      },
      {
        "title": "Fraud Review",
        "content": "Our fraud detection specialists meticulously review and cross-verify income documentation, debt statements, employment records, and supporting documentation. Our mortgage fraud analysis team leverages industry experience to identify missing information, suspicious patterns, falsified documents, and fraudulent data, preventing loan file kickbacks to processors and enabling underwriters to focus exclusively on loan approval decisions rather than document validation."
      },
      {
        "title": "Condition to Close",
        "content": "We compile a comprehensive list of all outstanding conditions, stipulations, and requirements necessary to clear the loan for closing, including documentation gaps, verification needs, and compliance requirements."
      },
      {
        "title": "Final Approval",
        "content": "Final underwriting approval confirmation authorizing the loan to proceed to closing once all conditions are satisfied and the loan meets all investor, regulatory, and internal lending guidelines."
      }
    ]
  },
  "mortgage-title": {
    "slug": "mortgage-title",
    "title": "Mortgage Title Services",
    "subtitle": "Comprehensive mortgage title ordering, examination & title insurance services",
    "icon": "fas fa-certificate",
    "color": "secondary",
    "sections": [
      {
        "title": "Title Ordering",
        "content": "We manage the complete title ordering workflow including settlement company coordination, title search requests, preliminary title report procurement, and final title policy delivery. We proactively follow up on all outstanding title orders to ensure timely receipt of initial commitments and final policies, preventing loan closing delays and ensuring smooth transaction closings."
      },
      {
        "title": "Title Examination",
        "content": "We perform comprehensive title examination reviewing the complete chain of title for defects, encumbrances, and irregularities. We analyze recorded documents including mortgages, liens, judgments, easements, covenants, restrictions, plat maps, and legal descriptions to confirm rightful ownership, identify legal restrictions, and verify property description accuracy for clear title certification."
      },
      {
        "title": "Title Commitment",
        "content": "We provide comprehensive title search and title commitment review services, helping lenders quickly understand title commitment exceptions, requirements, and Schedule B items. We identify title defects early to accelerate transaction closings and capture essential commitment data including easements, tax status, HOA liens, and property restrictions."
      },
      {
        "title": "Final Policy Production",
        "content": "We generate ALTA owner's policies (long form and short form) and lender's title insurance policies. We perform final title review to confirm clear ownership before policy issuance and deliver executed title insurance policies to new property owners and mortgage lenders upon successful closing."
      },
      {
        "title": "Title Insurance",
        "content": "We assist lenders in ordering owner's and lender's title insurance policies. We review title insurance commitments for coverage limits, exceptions, exclusions, deductibles, and policy terms, flagging any discrepancies or coverage gaps and coordinating with title underwriters and insurance carriers to resolve issues before closing."
      },
      {
        "title": "Settlement and Closing Services",
        "content": "We coordinate all settlement and closing activities including document signing, fund disbursement, and recording. We prepare HUD-1 Settlement Statements (or Closing Disclosures for TRID transactions) and assemble complete recording packages including deeds, mortgages, and assignments for county recorder filing."
      }
    ]
  },
  "mortgage-closing": {
    "slug": "mortgage-closing",
    "title": "Mortgage Closing Services",
    "subtitle": "Professional mortgage closing support, document preparation & closing coordination services",
    "icon": "fas fa-handshake",
    "color": "accent",
    "sections": [
      {
        "title": "Collect Mandatory Mortgage Docs",
        "content": "We collect and organize all mandatory closing documents including property inspection reports, appraisal reports, title commitments, Closing Disclosure (CD) forms, Loan Estimates (LE), preliminary title reports, surveys, water/sewer certifications, and FEMA flood certificates to ensure complete loan file assembly for successful mortgage closings."
      },
      {
        "title": "Review Property Title",
        "content": "We organize closing files in sequential order for efficient processing including final evaluation of recorded legal rights, review of title insurance policies with listed exceptions and exclusions, and examination of property plats identifying legal boundaries, encroachments, and recorded easements."
      },
      {
        "title": "Preparing Closing Instruction Statement",
        "content": "We perform final quality control review of loan applications, appraisal reports, flood certifications, inspection reports, and homeowner's insurance policies, then prepare detailed closing instructions for the funding department including promissory notes, wire transfer instructions, and E&O insurance certificates."
      },
      {
        "title": "Working with Settlement Companies",
        "content": "We coordinate with title companies and settlement agents to obtain fee sheets, escrow agreements, tax proration calculations, and lien payoff statements. We prepare and deliver lender closing instructions to settlement agents and confirm fund disbursement procedures for successful loan closing."
      },
      {
        "title": "Preparing and Dispatching Closing Docs",
        "content": "We prepare and deliver initial Closing Disclosures (CD) and all required closing documents including Loan Estimates, final CDs, TRID disclosures, and state-specific forms in full compliance with CFPB regulations. We follow up closely with settlement companies to ensure timely mortgage loan closing."
      },
      {
        "title": "Closing Serving Steps",
        "content": "We perform comprehensive closing servicing including title examination, tax and insurance escrow audits, statutory statement preparation, deed preparation, fee sheet compilation, preliminary HUD-1 preparation, and final HUD-1/CD preparation based on closing instructions and vendor invoices. We obtain closing protection letters (CPL) and secure wire transfer instructions for safe fund disbursement."
      }
    ]
  },
  "mortgage-post-closing": {
    "slug": "mortgage-post-closing",
    "title": "Mortgage Post-Closing Services",
    "subtitle": "Comprehensive post-closing quality control, compliance audit & loan file delivery services",
    "icon": "fas fa-tasks",
    "color": "primary",
    "sections": [
      {
        "title": "Trailing Document Retrieval",
        "content": "We proactively follow up with settlement companies, title companies, and county recorders via phone and email to retrieve all trailing documents including recorded mortgage deeds, trust deeds, assignment documents, tax proration statements, payoff confirmations, lien releases, modification agreements, mechanic's lien waivers, UCC filings, and judgment releases. We ensure all post-closing documents are received before final title policy issuance and investor loan delivery."
      },
      {
        "title": "Assembling the Post closing Loan Package",
        "content": "We collaborate with title companies, mortgage brokers, and settlement agents to assemble complete post-closing loan packages. We review closed loan files for accuracy, completeness, and investor compliance, verifying all required documents, endorsements, and certifications are present so loans can be insured, securitized, sold to investors (Fannie Mae, Freddie Mac, Ginnie Mae), and protected against fraud. We prepare shipping packages per specific investor requirements."
      },
      {
        "title": "Post Closing Data Integrity Audit",
        "content": "We conduct rigorous post-closing quality control audits to identify and remediate any loan file deficiencies, documentation errors, or compliance violations. Our mortgage post-closing audit includes occupancy verification, underwriter condition clearance confirmation, final CD accuracy check, and regulatory compliance validation."
      },
      {
        "title": "MERS Registration",
        "content": "We register all closed and funded mortgage loans with MERS (Mortgage Electronic Registration System) as part of our comprehensive post-closing workflow. MERS registration enables efficient tracking of beneficial ownership, servicing rights transfers, and lien positions throughout the loan's lifecycle."
      },
      {
        "title": "Post Closing Quality Control Review",
        "content": "We ensure 100% compliance with Fannie Mae, Freddie Mac, FHA, VA, and USDA underwriting requirements through our comprehensive post-closing QC review process. We meticulously audit income and asset documentation, re-verify employment status, compare signatures and initials, validate dates, review automated underwriting system (AUS) approvals, perform appraisal quality checks, and generate detailed audit reports for investor delivery and quality assurance."
      },
      {
        "title": "Tax, Insurance & Reserve Audits",
        "content": "We perform comprehensive audits of property tax escrows, hazard insurance (HOI) policies, flood insurance, mortgage insurance (PMI/MIP), and reserve account calculations to ensure proper escrow setup, adequate coverage limits, and compliance with investor reserve requirements."
      }
    ]
  },
  "document-management": {
    "slug": "document-management",
    "title": "Document Management Services",
    "subtitle": "Professional aviation document management for OEM manuals, technical publications & IATA compliance",
    "icon": "fas fa-file-alt",
    "color": "purple",
    "sections": [
      {
        "title": "Document Management Services",
        "content": "ARDUR Technology LLC serves as a seamless extension of your technical publications department, supporting your Document Management Software (DMS) and content management systems. We expertly manage the production, revision tracking, and editing of all OEM aircraft manuals, Engine manuals, Technical Publications, Service Bulletins, Airworthiness Directives (ADs), and regulatory-mandated documents in full compliance with IATA S1000D, ATA iSpec 2200, and EASA/FAA documentation standards."
      },
      {
        "title": "Data Processing",
        "content": "ARDUR Technology LLC acts as an extension of your team, supporting your Document Management Software. We manage the production and editing of OEM manuals, Technical Publications, and regulatory documents, ensuring full compliance with IATA standards and enhancing your operational efficiency."
      },
      {
        "title": "Editing",
        "content": "Ardur's technical editors normalize and standardize editing workflows across various distinct formats of updates from Aircraft OEMs (Boeing, Airbus), Engine manufacturers (GE, Pratt & Whitney, Rolls-Royce), and component suppliers. We eliminate the manual-intensive editing challenges faced by in-house teams, providing scalable technical documentation support and resolving editing capacity constraints for MROs and airlines."
      }
    ]
  },
  "electronic-asset-management": {
    "slug": "electronic-asset-management",
    "title": "Electronic Asset and Record Management",
    "subtitle": "Digital aircraft records management & technical records services for the complete asset lifecycle",
    "icon": "fas fa-database",
    "color": "secondary",
    "sections": [
      {
        "title": "Asset Management Services",
        "content": "Your aircraft technical records are the foundation of asset value and airworthiness compliance. We provide specialized aircraft records management services to handle the massive volume of maintenance data, inspection records, and compliance documentation generated throughout an aircraft's operational lifecycle. Combining advanced digital tool systems with certified aircraft maintenance engineers (AMEs) and aerospace engineers, Ardur ensures 100% accurate record keeping, reduces hundreds of manual hours in back-to-birth traceability reviews, enhances records quality for lease transitions, and supports your aviation digital transformation and paperless aircraft records initiatives."
      },
      {
        "title": "Electronic Asset and Record Management",
        "content": "Our digitized aircraft records cleaning and editing services ensure your technical records are accurate, complete, and audit-ready, accessible 24/7 from anywhere globally. We specialize in rapid data cleansing and record digitization for time-sensitive aircraft transitions including lease returns, aircraft sales, and pre-buy inspections. By blending experienced human technical reviewers with cutting-edge OCR technology and digital indexing systems, we deliver the most cost-effective and compliant aircraft records management solution for lessors, airlines, MROs, and aviation asset management companies."
      },
      {
        "title": "Our Records Management Services Include",
        "bullets": [
          "Data and Records Management - Enterprise Data Warehouse",
          "Aircraft Records indexing",
          "Digital Migration",
          "Check Pack Audit",
          "Auditing of Daily and Heavy Maintenance checks",
          "Data entry at source (DEAS)",
          "Part transaction details audit",
          "Back to Birth Traceability",
          "Technical Review",
          "Records life cycle management",
          "Delivery Bible review"
        ]
      }
    ]
  },
  "programs-reliability": {
    "slug": "programs-reliability",
    "title": "Programs & Reliability Services",
    "subtitle": "Comprehensive maintenance planning, work scope building & airworthiness compliance services",
    "icon": "fas fa-check-double",
    "color": "accent",
    "sections": [
      {
        "title": "Our Services",
        "bullets": [
          "Build Work scopes and Bridging checks according to MPD",
          "Airworthiness Directives status Review",
          "Modification's documentation status review (Current status of Operators Mods, STCs - Major modification)",
          "Structural Repair documentation review (Dent and buckle file review, Repair trawl)",
          "Components Documentation review (OCCM - On condition and Condition monitoring current status, HT - Hard Time components current status)",
          "Back to Birth traceability of LLPs (Compliance documentation review for LLPs, MTS - Movement Traceability Sheet preparation)",
          "Structural inspection and CPCP",
          "LDND status review"
        ]
      }
    ]
  },
  "assemblies-services": {
    "slug": "assemblies-services",
    "title": "Assemblies Services",
    "subtitle": "Complete lifecycle management for aircraft engines, APUs, landing gear & rotable components",
    "icon": "fas fa-cogs",
    "color": "primary",
    "sections": [
      {
        "title": "Assemblies Services",
        "bullets": [
          "Engine/APU/LDG full cycle records management",
          "Plotting Engine/APU/Landing Gear removals for Overhaul and shop Visits",
          "Build and Audit of Engine/APU/Landing Gear Current Status from birth",
          "Back-to-birth traceability of LLPs of Engine/APU/Landing Gear",
          "Establish Overhaul requirements for components"
        ]
      }
    ]
  },
  "service-expertise": {
    "slug": "service-expertise",
    "title": "Service Expertise",
    "subtitle": "Specialized aviation MRO consulting, maintenance planning & regulatory compliance expertise",
    "icon": "fas fa-user-cog",
    "color": "warning",
    "sections": [
      {
        "title": "Our Expertise",
        "bullets": [
          "MPD – Maintenance Planning Document",
          "AMP – Aircraft Maintenance Programme/Approved maintenance Programme",
          "LDND – Last Done Next Due",
          "OCCM – On Condition and Condition Monitoring of components",
          "HT – Hard Time components",
          "Service Bulletins, Operator Mods (Airframe/Engine/APU/Landing Gear)",
          "Repair trawl, Dent and Buckle chart Audit",
          "LLP – BTB traceability of LLPs",
          "QEC & LRU – Quick Engine Change and Line Replaceable Units",
          "Auditing of Daily and Heavy Maintenance Checks",
          "Digital Migration"
        ]
      },
      {
        "title": "Features",
        "content": "Ardur transforms your aircraft maintenance data into industry-standard digital formats including ATA Spec 2000, ATA Spec 2300, and SPEC 2500 compliant digital records, dramatically reducing the time, cost, and administrative burden of managing aircraft technical records while maximizing asset value. Our Maintenance History digitization services ensure your complete aircraft logbook, work order history, and inspection records are accessible 24/7 from cloud-based platforms. We maintain comprehensive digital 'Delivery Bible' packages—complete aircraft portfolios documenting all maintenance status, AD compliance, SB embodiment, and component traceability for seamless lease returns and aircraft transitions."
      }
    ]
  },
  "technical-documents": {
    "slug": "technical-documents",
    "title": "Technical and Planning Documents",
    "subtitle": "Expert management of aviation technical & planning documentation per EASA/FAA standards",
    "icon": "fas fa-book",
    "color": "purple",
    "sections": [
      {
        "title": "Technical Documents",
        "bullets": [
          "AMM – Aircraft Maintenance Manual",
          "CMM – Component Maintenance Manual",
          "EO – Engineering Orders",
          "ED – Engineering Disposition",
          "EA – Engineering Authorization",
          "RADS – Repair Design Approval Sheet",
          "EMM – Engine Maintenance Manual",
          "SRM – Structural Repair Manual",
          "RDAF – Repair Design Approval Form",
          "TA – Technical Adaptation"
        ]
      },
      {
        "title": "Planning Documents",
        "bullets": [
          "MPD – Maintenance Planning Document",
          "AMP – Approved Maintenance Programme",
          "ALS – Airworthiness Limitations"
        ]
      }
    ]
  },
  "engine-maintenance-analytics": {
    "slug": "engine-maintenance-analytics",
    "title": "Predictive Engine Maintenance Analytics",
    "subtitle": "AI-powered predictive maintenance analytics & machine learning for aircraft engine performance optimization",
    "icon": "fas fa-chart-line",
    "color": "secondary",
    "sections": [
      {
        "title": "Engine Water Wash",
        "content": "Inadequate or improperly timed engine water wash procedures can severely impact turbine aerodynamic efficiency, fuel consumption, and thrust performance. Our AI-powered predictive analytics and machine learning algorithms optimize engine wash scheduling, ensuring timely and effective compressor cleaning cycles. This extends engine component lifespan (hot section, fan blades, compressor stages), prevents corrosion and FOD damage, and ultimately reduces unplanned maintenance costs and fuel burn, delivering measurable ROI for airlines and lessors.",
        "subsection": {
          "title": "Solution",
          "content": "We developed a proprietary machine-learning algorithm using Random Forest classification that accurately predicts engine water wash effectiveness based on multi-sensor data correlation analysis. This predictive model helped a major aircraft MRO partner avoid millions in unplanned maintenance costs by triggering real-time alerts for low-effectiveness wash events. The solution was deployed across 3-4 engine families (CFM56, V2500, Trent series) on a global fleet, delivering $70M in documented cost savings through optimized wash scheduling, reduced engine deterioration, and prevention of premature shop visits."
        }
      },
      {
        "title": "Anomaly Detection for Aircraft Engines",
        "content": "Every minute an aircraft remains AOG (Aircraft on Ground) represents significant lost revenue and operational disruption. Our advanced anomaly detection algorithms and predictive maintenance systems identify component degradation patterns and predict engine failures before they occur, enabling proactive maintenance scheduling. This minimizes unplanned AOG events, prevents costly unscheduled shop visits, optimizes engine removal planning, and significantly reduces maintenance costs while maximizing aircraft utilization and operational uptime for airlines and operators.",
        "subsection": {
          "title": "Solution",
          "content": "We developed a sophisticated anomaly detection algorithm using Gaussian Mixture Models (GMM) to identify subtle abnormalities in engine performance trending data from ACARS, EHM (Engine Health Monitoring), and sensor telemetry. The trained predictive model detects early degradation signals by analyzing multi-dimensional sensor patterns including EGT margins, vibration signatures, fuel flow deviations, and oil consumption trends. The system raises prioritized alerts for high-severity anomalies requiring immediate attention, enabling preventative maintenance action before in-flight shutdowns or forced removals occur. This ML-based predictive maintenance solution delivered $27M in quantified savings from avoided unscheduled engine shop visits, reduced warranty claims, and optimized maintenance planning."
        }
      },
      {
        "title": "Why Choose Ardur for Aircraft Services",
        "type": "benefits",
        "benefits": [
          {
            "title": "Cost Arbitrage",
            "description": "INDIA has one of the largest pools of qualified and experienced Aviation Professionals (AMEs, Aeronautical Engineers and Aerospace Engineers) that delivers a quality service along with a cost advantage of 60% savings against your local cost."
          },
          {
            "title": "Customised Services",
            "description": "We focus on partnering and understanding our client's requirement by leveraging off our extensive skills and experience, that meet the complexity of the project."
          },
          {
            "title": "Seamless Coordination",
            "description": "We work as an extension of our client's workforce by monitoring the day-to-day activities of a project and update all concerned stakeholders about progress."
          },
          {
            "title": "High Quality Service",
            "description": "We fulfil our motto of being a 'Partner of Choice' by contributing to Process Improvements, whereby it leading to increasing the efficiency and improving the Quality of the Clients data."
          },
          {
            "title": "Passion",
            "description": "The passion of our team towards the aviation world is the core of our business."
          },
          {
            "title": "Commitment",
            "description": "We value the client's expectations and strive to remain committed to fulfil them."
          },
          {
            "title": "Accountability & Dependability",
            "description": "The approach of the team is to sail through the intricate world of aviation and increase the accountability. We possess the forward-thinking solutions, to increase our dependability."
          }
        ]
      }
    ]
  },
  "software-development": {
    "slug": "software-development",
    "title": "Custom Software Development Services",
    "subtitle": "End-to-end enterprise software development, modernization & integration for regulated industries",
    "icon": "fas fa-code",
    "color": "primary",
    "sections": [
      {
        "title": "Custom Enterprise Application Development",
        "content": "ARDUR Technology LLC designs and builds custom enterprise applications tailored to the exact workflows of mortgage, title, healthcare, aviation, and financial services organizations. We translate complex business rules, document-heavy processes, and compliance requirements into robust, scalable software platforms that automate manual work, reduce operational risk, and improve decision-making. Our teams specialize in full-stack web application development, microservices architectures, and API-first business platforms engineered for long-term maintainability."
      },
      {
        "title": "Web, Mobile & Cloud-Native Solutions",
        "content": "We develop modern web applications, responsive portals, and secure mobile apps that give your teams and customers seamless access to critical data from any device. Using cloud-native architectures, containerization, and managed services on AWS, Azure, and GCP, we build applications that are performant, resilient, and ready to scale with business growth. From internal operations dashboards to customer-facing self-service portals, we align UX, performance, and security to your industry’s regulatory environment."
      },
      {
        "title": "Legacy Modernization & Platform Re-Engineering",
        "content": "Many lenders, title companies, and aviation organizations still rely on legacy systems, spreadsheets, and manual workflows. ARDUR modernizes these systems by re-engineering monolithic applications into modular, API-driven platforms. We refactor critical components, migrate data safely, and introduce automation around underwriting, document review, compliance checks, and reporting. This approach reduces technical debt, improves stability, and creates a foundation for analytics, automation, and AI enablement."
      },
      {
        "title": "Systems Integration & API Development",
        "content": "We design and implement secure integrations between LOS platforms, CRM systems, title production software, document management systems, MRO platforms, and third-party data providers. Our integration teams build RESTful APIs, webhooks, and middleware services that synchronize customer records, loan data, aircraft technical documents, and operational metrics across your technology stack. The result is a single source of truth, fewer data silos, and faster end-to-end cycle times across your business processes."
      },
      {
        "title": "Secure, Compliant Software Engineering",
        "content": "ARDUR Technology LLC embeds robust security and compliance controls into every phase of the software development lifecycle. We follow secure coding best practices, role-based access control (RBAC), data encryption, detailed audit logging, and environment hardening aligned with frameworks such as SOC 2, ISO 27001, HIPAA, and GDPR where applicable. Our delivery model includes peer code reviews, static code analysis, vulnerability scanning, and structured release management to reduce production risk and ensure regulatory readiness."
      },
      {
        "title": "Quality Assurance, Test Automation & Support",
        "content": "We provide comprehensive functional, regression, integration, and performance testing for mission-critical applications. Our QA engineers design automated test suites using modern test frameworks to reduce manual testing cycles and catch defects earlier. In addition, ARDUR offers long-term application maintenance, enhancement, and production support services, keeping your systems secure, up-to-date, and aligned with changing investor, regulatory, and business requirements."
      },
      {
        "title": "Why Choose Ardur for Software Development",
        "type": "benefits",
        "benefits": [
          {
            "title": "Deep Domain Expertise",
            "description": "We combine strong software engineering capabilities with hands-on experience in mortgage, title, aviation, and healthcare operations, ensuring solutions reflect real-world workflows and compliance obligations."
          },
          {
            "title": "Scalable Global Delivery",
            "description": "Our India-based engineering teams deliver high-quality software at a competitive cost, providing a strong cost arbitrage while maintaining enterprise-grade standards and communication."
          },
          {
            "title": "Modern Tech Stack & Architecture",
            "description": "We design cloud-native, API-driven systems that are easy to integrate, extend, and maintain, avoiding the technical debt and rigidity common in legacy platforms."
          },
          {
            "title": "Security-First Mindset",
            "description": "From authentication and access control to encryption and audit trails, every solution is built with security, data privacy, and regulatory compliance at its core."
          },
          {
            "title": "End-to-End Ownership",
            "description": "We take ownership from requirements discovery and UX design through development, QA, deployment, monitoring, and long-term support, giving clients a single accountable technology partner."
          }
        ]
      }
    ]
  },
  "data-analytics": {
    "slug": "data-analytics",
    "title": "Data Analytics & Business Intelligence Services",
    "subtitle": "Actionable data analytics, dashboards & machine learning for mortgage, title, aviation & healthcare operations",
    "icon": "fas fa-chart-bar",
    "color": "secondary",
    "sections": [
      {
        "title": "Data Strategy & Analytics Roadmapping",
        "content": "ARDUR Technology LLC helps organizations define a clear data and analytics strategy that aligns with business goals—whether that is reducing loan turn times, improving appraisal quality, optimizing aircraft maintenance, or increasing healthcare revenue cycle efficiency. We assess current data sources, reporting gaps, and decision-making bottlenecks, then design a practical analytics roadmap covering data integration, quality, governance, and analytics use cases that deliver measurable ROI."
      },
      {
        "title": "Data Engineering, ETL & Warehouse Modernization",
        "content": "We design and build robust data pipelines that extract, transform, and load data from LOS platforms, servicing systems, title production software, MRO systems, EMR/EHR platforms, and CRM tools into centralized data warehouses or data lakes. Our data engineering teams standardize and cleanse fragmented datasets, resolve duplicates, and create analytics-ready models, enabling consistent reporting across lending, operations, quality control, compliance, and finance teams."
      },
      {
        "title": "Interactive Dashboards & Self-Service BI",
        "content": "ARDUR develops interactive dashboards and reports that give executives and operations teams real-time visibility into loan pipelines, turn times, conditions aging, trailing document status, appraisal performance, aircraft fleet health, maintenance events, claims, and revenue. Using leading BI platforms, we enable self-service analytics so business users can slice and filter data, track KPIs, and drill down into root causes without relying on IT for every report."
      },
      {
        "title": "Advanced Analytics, Predictive Modeling & AI",
        "content": "Building on our experience with predictive engine maintenance analytics, we apply advanced analytics and machine learning to key business problems across mortgage, title, aviation, and healthcare. Use cases include loan default risk modeling, fraud detection, operational workload forecasting, staffing optimization, anomaly detection in aircraft engine telemetry, and revenue leakage identification. Our data scientists design, validate, and deploy models into production workflows so insights are embedded directly into daily operations."
      },
      {
        "title": "Data Governance, Quality & Compliance",
        "content": "We help clients establish strong data governance frameworks covering data ownership, definitions, quality rules, lineage, access control, and retention policies. For highly regulated domains such as mortgage and healthcare, ARDUR designs analytics environments that support privacy, security, and regulatory compliance—ensuring sensitive borrower, patient, and aircraft records are properly protected while still available for legitimate analytic use."
      },
      {
        "title": "Analytics Operationalization & Ongoing Optimization",
        "content": "Our teams don’t stop at building dashboards and models—we ensure analytics is operationalized and continuously improved. We integrate analytics outputs into LOS workflows, document-processing queues, maintenance planning systems, and management review routines. Over time, we refine models based on new data, monitor performance drift, and adjust KPI definitions so your analytics program stays aligned with evolving business goals and regulatory requirements."
      },
      {
        "title": "Why Choose Ardur for Data Analytics",
        "type": "benefits",
        "benefits": [
          {
            "title": "Operations-Driven Analytics",
            "description": "We focus on practical analytics use cases that directly impact loan quality, cycle times, maintenance costs, utilization, and revenue, rather than theoretical data science experiments."
          },
          {
            "title": "Cross-Industry Expertise",
            "description": "Our experience across mortgage, title, aviation, and healthcare lets us apply proven analytic patterns—from anomaly detection to predictive maintenance—across multiple verticals."
          },
          {
            "title": "Strong Engineering + Data Science Blend",
            "description": "We combine solid data engineering foundations with advanced modeling expertise, ensuring that dashboards and models are built on reliable, governed data pipelines."
          },
          {
            "title": "Regulatory & Security Awareness",
            "description": "We design analytics ecosystems that respect data privacy, access controls, and auditability requirements in regulated markets, reducing compliance risk."
          },
          {
            "title": "Scalable & Cost-Effective Delivery",
            "description": "Our India-based analytics and engineering teams deliver high-quality solutions at a competitive cost, making enterprise-grade analytics accessible to mid-sized and large organizations alike."
          }
        ]
      },
      {
        "title": "Our Strengths",
        "bullets": [
          "SUBJECT MATTER EXPERTS (SMEs)",
          "EXCELLENT COMMUNICATION SKILLS",
          "PROMPT RESOLUTION",
          "BESPOKE SERVICE",
          "SEAMLESS COORDINATION"
        ]
      }
    ]
  }
}