{
  "mortgage-pre-processing": {
    "slug": "mortgage-pre-processing",
    "title": "Mortgage Pre-Processing Support Services",
    "subtitle": "Comprehensive pre-processing support for faster loan approvals",
    "icon": "fas fa-file-contract",
    "color": "secondary",
    "sections": [
      {
        "title": "Rate Lock Management",
        "content": "We take charge of the entire process, ensuring that loan seekers get a response from you in the shortest possible time. We achieve such diligent turnaround times by coordinating with the customer to get a commitment on the loan within the stipulated time period of the lock-in time period."
      },
      {
        "title": "CAIVARS Verification",
        "content": "We scrutinize borrower details to ensure there are no past records of delinquent federal non-tax debt. We verify their profile on the CAIVARS system, as per the guidelines of the Debt Collection Improvement Act."
      },
      {
        "title": "1003 Review",
        "content": "We meticulously scrutinize the application to make sure that all of the personal information furnished by the applicant such as name, work history, signatures, property details, loan details, employment information and income information are all accurate."
      },
      {
        "title": "MERS Check",
        "content": "Our team of mortgage experts compile detailed customer reports and update them on the MERS (Mortgage Electronic Registration system) to ensure that you can track the progress of your entire mortgage loan approval process."
      },
      {
        "title": "Loan Estimation Review",
        "content": "We compile and dispatch the estimate of a loan structure to the customers, after including basic information like issue date, loan term, loan type, rate lock information and so on. We verify other details of a loan estimate form like closing costs, Annual Percentage Rate and projected payment plan."
      },
      {
        "title": "Generation of Disclosures",
        "content": "We generate all mandatory mortgage loan disclosures as dictated by the terms of the federal law, to the borrower based on the loan estimation process. We then review and send these disclosures to the borrower to complete a crucial step of the mortgage pre-processing procedure."
      }
    ]
  },
  "mortgage-ancillary": {
    "slug": "mortgage-ancillary",
    "title": "Mortgage Ancillary Services",
    "subtitle": "Document management and third-party verification services",
    "icon": "fas fa-folder-open",
    "color": "accent",
    "sections": [
      {
        "title": "Indexing and Stacking",
        "content": "We assist lenders in collecting supporting documents such as bank statements, mortgage statements, pension statements, escrow documents, divorce decrees and child support documents, etc. We also order homeowner's insurance and the flood certificate for the property. After collecting all the documents, we file them in an orderly way for easy access and archival."
      },
      {
        "title": "Third Part Document Verification",
        "content": "We review third party documents like Appraisal, Title, HOI, 4506T (Tax Transcripts) etc. as loan application references and details of the property to authorized appraisers. We also check payment receipts for appropriate appraisal fees and check property titles. We provide you a detailed report to be complaint with regulations with a clear focus on contradictory information, incompatible findings and data that cannot be validated."
      },
      {
        "title": "Data Capture in LOS",
        "content": "We review 1003 form and all other documents such as W2s, pay stubs, GFE, TIL, Form 1008, borrower's authorization etc., to ensure that all the information necessary for processing the application is provided."
      }
    ]
  },
  "mortgage-appraisal": {
    "slug": "mortgage-appraisal",
    "title": "Mortgage Appraisal Services",
    "subtitle": "Professional property appraisal and valuation services",
    "icon": "fas fa-home-lg-alt",
    "color": "primary",
    "sections": [
      {
        "title": "Broker Price Opinion",
        "content": "Provide Broker price opinions for property value less than 250K."
      },
      {
        "title": "Appraiser Panel Review",
        "content": "Mortgage policies and guidelines can vary by area, so keeping current with the policies is a challenge. Our team will review the appraisal to make sure it is consistent with best practices, adheres to the Uniform Appraisal Dataset (UAD) and the Uniform Standards of Professional Appraisal Practice (USPAP)."
      },
      {
        "title": "Compliance",
        "content": "We thoroughly examine the appraiser's report for anomalies. We review the basis for the valuation, verify if the appraisal report is compliant with mortgage rules and regulations, and check if the appraisal is carried out according to the federal, state, and GSE guidelines."
      },
      {
        "title": "Comparative Market Analysis",
        "content": "Using the average cost of properties sold with similar attributes, we'll gather data like listed price, time on the market, price of sale, and more. This expedites securing financing and assures that the price you pay is fair."
      },
      {
        "title": "Title Assessment",
        "content": "Lenders like to avoid unnecessary risk, so can review tax, judgment, and transfer records. This makes the lender and the borrower more comfortable with the deal."
      }
    ]
  },
  "mortgage-underwriting": {
    "slug": "mortgage-underwriting",
    "title": "Mortgage Underwriting Services",
    "subtitle": "Complete underwriting support and risk assessment",
    "icon": "fas fa-clipboard-check",
    "color": "purple",
    "sections": [
      {
        "title": "Pre-Underwriting (Loan Submission)",
        "content": "We submit your application to an underwriter for crosschecking your eligibility and validating the documents submitted. If the underwriter feels there are conditions to clear such as explanation of late payments or employment gaps, we help you speed up the condition clearing process."
      },
      {
        "title": "Credit Report",
        "content": "Order credit report and review it. We conduct a complete credit check of prospective borrowers to ascertain their credit worthiness. This includes pre-screening of credentials, obtaining and checking credit reports, credit history, FHA authorizations, Social Security status and more. We also check for existing loans with MERS, payment defaults, tax returns and transcripts, etc."
      },
      {
        "title": "Income and Asset Review",
        "content": "We conduct verification checks against all information provided by the prospective borrowers. This includes verification of disclosures for accuracy, VoE (Verification of Employment), VoD (Verification of Deposit), VoM (Verification of Mortgage), verification of property sale history, location maps, the appraiser's signature and license, registration, etc. We verify all borrower's information like pay stubs, W2 forms, asset information, employment history etc. by using Verification of Deposit and Verification of Mortgage forms."
      },
      {
        "title": "Borrower File Review",
        "content": "We verify all information that is supplied by the customer in vital loan documents like form 1003 and other personal information. We meticulously review customer credit records like FICO scores and tax return documents to ensure the customer has the required financial stability to make monthly payments for the loan. We evaluate the entire credit profile of the borrower as per the guidelines laid down by Fannie Mae and Freddie Mac. As an experienced mortgage pre-underwriting support company, we follow a checklist-based system to ensure that all the critical aspects pertaining to underwriting are covered in our file review services."
      },
      {
        "title": "Data Validation",
        "content": "Certain customer details like credit scores and employment history can be verified online using the Desktop Underwriter (DU), the official tool created by Fannie Mae and Freddie Mac. This tool helps us validate customer attributes like credit scores which are vital for the loan approval process. Our pre-underwriting support services include recording and digitizing our findings in the data validation process. By digitizing these vital information sets about the customer, we are able to establish the accuracy and speed needed to expedite the underwriting process."
      },
      {
        "title": "Fraud Review",
        "content": "Documenting and double checking income and debt statements and verifying all other submitted docs. Our team of mortgage experts have the experience and acumen to spot missing or mala fide information. This obviates the need for the underwriter to send customer files back for completed information and thereby enables you speed up the underwriting process. Our fraud analysis encompasses all aspects of the customer file review process including running third-party reports. This ensures the underwriter has to focus only on decision-making."
      },
      {
        "title": "Condition to Close",
        "content": "List out the observations and conditions to close."
      },
      {
        "title": "Final Approval",
        "content": "Approval to go for closing."
      }
    ]
  },
  "mortgage-title": {
    "slug": "mortgage-title",
    "title": "Mortgage Title Services",
    "subtitle": "Complete title ordering, examination and insurance services",
    "icon": "fas fa-certificate",
    "color": "secondary",
    "sections": [
      {
        "title": "Title Ordering",
        "content": "Obtain and verify details about mortgage title or settlement company. Order and follow up to obtain initial and Final Title report."
      },
      {
        "title": "Title Examination",
        "content": "Review title reports and examine the chain of title to ensure no illegal deeds exist. Analyze records, such as mortgages, liens, judgments, easements, vital statistics, and plat and map books, to determine ownership and legal restrictions. Verify legal description of property and completeness of records."
      },
      {
        "title": "Title Commitment",
        "content": "Provide a comprehensive title search and review. Assist lenders in reading the title commitment report easily. Uncover defects early on to help close transactions quickly. Capture essential data for commitment easement, tax status, and restrictions."
      },
      {
        "title": "Final Policy Production",
        "content": "Generate long form, short form, and owner policies. Final review of records to determine the true owner of the property before policy issuance. Forward the new title insurance policies to the new owner and lender."
      },
      {
        "title": "Title Insurance",
        "content": "Assist lenders in ordering insurance for the property. Review the insurance document for building conditions, lien, deductibles, policy period, etc. Flag inconsistencies in the title insurance document and coordinate with carriers and underwriters to get them corrected."
      },
      {
        "title": "Settlement and Closing Services",
        "content": "Structure the signing and exchange of all documents in an orderly manner. Assist in the preparation of a HUD 1 statement. Assist in completing documents needed for recording services."
      }
    ]
  },
  "mortgage-closing": {
    "slug": "mortgage-closing",
    "title": "Mortgage Closing Services",
    "subtitle": "End-to-end closing document preparation and coordination",
    "icon": "fas fa-handshake",
    "color": "accent",
    "sections": [
      {
        "title": "Collect Mandatory Mortgage Docs",
        "content": "Collect all important documents required for successful mortgage closing (inspection reports, appraisals, title documents, CD forms, Loan Estimates, title search documents, etc.). Collect documents related to the property's location (water and sewer certification, flood certificates, etc.)."
      },
      {
        "title": "Review Property Title",
        "content": "Arrange the required files in the right order to facilitate easy processing - Final evaluation of recorded legal rights. Review of the Title insurance policy with its listed exclusions. Review of the plat, which indicates the legal property boundaries and any records of encroachments or easements."
      },
      {
        "title": "Preparing Closing Instruction Statement",
        "content": "Final review of the loan application for errors, which includes appraisal reports, flood certificates, inspection reports, homeowner's insurance, etc. Deliver the closing instructions statement to the funding department, along with bank notes, wiring instructions, and E&O insurance."
      },
      {
        "title": "Working with Settlement Companies",
        "content": "Reach out to settlement companies for fee sheets. Obtain the escrow agreement. Evaluate taxes and fees. Send lender instructions to the settlement agent. Determine how funds will be distributed at closing."
      },
      {
        "title": "Preparing and Dispatching Closing Docs",
        "content": "Prepare and send the initial CD and other closing documents (Loan estimates, closing disclosures, etc.). Ensure 100% compliance with federal regulations. Follow up with settlement companies in closing the mortgage loan."
      },
      {
        "title": "Closing Serving Steps",
        "content": "Examine Title. Tax, insurance & reserve audits. Preparation of statutory statements and deed. Prepare the document order form and fee sheet. Prepare the Prelim HUDs (settlement statements) and Final HUDs based on the Closing Instructions/Fee Sheets/Invoices. Obtain closing protection letters and wiring instructions."
      }
    ]
  },
  "mortgage-post-closing": {
    "slug": "mortgage-post-closing",
    "title": "Mortgage Post-Closing Services",
    "subtitle": "Quality control and compliance audit services",
    "icon": "fas fa-tasks",
    "color": "primary",
    "sections": [
      {
        "title": "Trailing Document Retrieval",
        "content": "We follow up with third-parties via phone and email to retrieve trailing documents such as mortgage or trust deeds, assignments, tax records, modifications, assumption agreements, mechanic's liens, UCC records, judgments, and more. Assignment, lien release, and final title policy issuance are all done only after completion of this process."
      },
      {
        "title": "Assembling the Post closing Loan Package",
        "content": "Work with title companies and brokers to review and assemble the final post-closing package. Review post-closing loan packages for accuracy and completeness. Evaluate whether the file meets your requirements so that the loan can be insured, sold, and protected against fraud. Prepare a shipping package per investor preferences."
      },
      {
        "title": "Post Closing Data Integrity Audit",
        "content": "We conduct a post-closing mortgage audit to address deficiencies that may have crept in. This is a critical step for mortgage post-closing and includes tasks such as verifying occupancy, addressing issues flagged by the underwriters, etc."
      },
      {
        "title": "MERS Registration",
        "content": "We register all approved loans with MERS (Mortgage Electronic Registration System) as part of our post-closing process. It is designed to track rights and ownership of mortgage loans."
      },
      {
        "title": "Post Closing Quality Control Review",
        "content": "Ensure complete compliance with underwriting requirements as mandated by Freddie Mac. Meticulously monitor the overall quality of mortgage production such as income and assets; re-verification of employment, comparison of signatures, initials and dates; review of automated underwriting approval; appraisal review; audit reports etc."
      },
      {
        "title": "Tax, Insurance & Reserve Audits",
        "content": "Review of all insurance, tax, and reserve requirements. Check that standards are upheld for reserves."
      }
    ]
  }
}
